public class Task2 {
    //(A)private (B)default (C)protected (D)public

    //Сопоставьте область видимости и модификаторы доступа, для каждой области возможны несколько вариантов.

    //1. Один и тот же класс   answer:   A B C D
    //2. Подкласс, находящийся в том же пакете, что и суперкласс  answer:   B C D
    //3. Класс из того же самого пакета, не являющийся подклассом   answer: B C D
    //4. Подкласс, находящийся в другом пакете   answer:   D C
    //5. Класс из другого пакета, не являющийся подклассом данного   answer:   D

}
